import Link from "next/link";
import Circle from "./Circle";
import ImageFallback from "./ImageFallback";

function Cta() {
  return (
    <section className="cta section pt-0" dir="rtl">
      <div className="container-xl">
        <div className="section relative px-4 ">
          <div className="animate">
            <h2 className="section-title text-center">
              همین الان ربات ترید شخصیتو سفارش بده
            </h2>
            <p className="mt-10">
            با استفاده از ربات‌های ترید، شما می‌توانید به طور خودکار و بدون نیاز به نظارت مستمر، در بازارهای مالی فعالیت کنید. این ربات‌ها بر اساس تحلیل‌های داده‌ای دقیق و الگوریتم‌های پیشرفته عمل می‌کنند تا شما بتوانید از نوسانات بازار بهره‌برداری کنید. به علاوه، ربات‌های ترید قادرند 24/7 بدون وقفه فعالیت کنند، به این معنا که هیچ زمانی از دست نمی‌رود و تمام فرصت‌های سودآور در بازار را شناسایی می‌کنند. برخلاف تریدرهای انسانی که تحت تأثیر احساسات و شرایط روانی قرار می‌گیرند، ربات‌ها هیچ‌گونه ترس یا طمع ندارند و همیشه بر اساس داده‌های واقعی و تحلیل‌های منطقی تصمیم‌گیری می‌کنند.
<br></br>
این ویژگی باعث می‌شود که ربات‌ها به طور مؤثری از اشتباهات ناشی از تصمیمات احساسی جلوگیری کنند و مانع از صفر شدن حساب شما شوند. در نتیجه، شما می‌توانید با استفاده از ربات‌های ترید، نه تنها از ضررهای بزرگ جلوگیری کنید بلکه شانس خود را برای رشد و پیشرفت مالی بهبود بخشید. همچنین، این ربات‌ها به جای تمرکز بر موفقیت‌های کوتاه‌مدت و احتمالی، بر روی تحلیل داده‌های دقیق و واقعی متمرکز هستند که می‌تواند شما را در مسیر رشد پایدار قرار دهد.
<br></br>
با سفارش ساخت ربات ترید اختصاصی، شما می‌توانید رباتی با ویژگی‌های خاص و الگوریتم‌های بهینه ایجاد کنید که متناسب با نیازها و استراتژی‌های معاملاتی شما باشد. این ربات‌ها قادر به تحلیل و پردازش حجم بالای داده‌ها به صورت خودکار و در زمان‌های مناسب هستند، بدون اینکه شما نیاز به انجام کاری داشته باشید. همچنین با اصلاحات مداوم و بهبود الگوریتم‌ها، ربات‌های ترید به مرور زمان کارایی بیشتری پیدا کرده و عملکرد خود را بهبود می‌بخشند.
<br></br>
اگر به دنبال یک راهکار هوشمندانه و مطمئن برای بهبود نتایج معاملات خود هستید، سفارش ساخت ربات ترید می‌تواند بهترین گزینه باشد. با این ربات‌ها، شما از عملکرد ثابت، تحلیل‌های دقیق و بدون خطای انسانی بهره‌مند خواهید شد و می‌توانید در دنیای پیچیده بازارهای مالی با اعتماد به نفس بیشتر و ریسک کمتر عمل کنید.
            </p>
           
           <div className="text-center">
           <Link href="/plans" className="btn btn-primary mt-10">
              مشاوره و سفارش
            </Link>
           </div>
            
          </div>
          <div className="bg-theme animated-bg absolute top-0 left-0 w-full after:hidden">
            <ImageFallback
              src="/images/wave.svg"
              fill={true}
              sizes="100vw"
              alt="bg wave"
            />
            <Circle
              className="left-[10%] top-12"
              width={32}
              height={32}
              fill={false}
            />
            <Circle className="left-[3%] bottom-[13%]" width={85} height={85} />
            <Circle
              className="left-[15%] bottom-[35%]"
              width={47}
              height={47}
              fill={false}
            />
            <Circle className="right-[12%] top-[12%]" width={20} height={20} />
            <Circle
              className="right-[2%] bottom-[30%]"
              width={73}
              height={73}
              fill={false}
            />
            <Circle
              className="right-[19%] bottom-[16%]"
              width={37}
              height={37}
              fill={false}
            />
          </div>
        </div>
      </div>
    </section>
  );
}

export default Cta;
